Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ཁོ་བོས་དེ་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་འཇིག་རྟེན་དང་། འཇིག་རྟེན་ལས་འདས་པའི་བཟོའི་གནས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག་ཐོབ་པ།
en: “Noble one, I know only that, and therefore how could I know or describe the qualities of the bodhisattvas who have attained perfection in all mundane and supramundane arts; who engage in all arts; who comprehend all writing, numbers, counting, and calculations;

source: བཟོའི་གནས་ཐམས་ཅད་ལ་འཇུག་པ་དང་། ཡི་གེ་དང་གྲངས་དང་རྩིས་དང་ཤོད་ཐབས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སྔགས་དང་སྨན་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་མཁས་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། འབྱུང་པོ་དང་། གཟའ་དང་སྐར་མ་དང་། བརྗེད་བྱེད་དང་། བྱད་སྟེམས་དང་། རོ་ལངས་ཀྱི་གདོན་ཐམས་ཅད་གསོ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་གསོ་བར་བྱ་བའི་སྨན་དང་ཐབས་ཀྱི་རྒྱུས་དང་ཁམས་ཀྱི་ཐབས་ཡོངས་སུ་བསྡུ་བའི་ཆོ་ག་དང་། གསེར་དང་ནོར་བུ་དང་། མུ་ཏིག་དང་བཻཌཱུརྱ་དང་། དུང་དང་མན་ཤེལ་དང་། བྱི་རུ་དང་། མུ་ཏིག་དམར་པོ་དང་། མུ་ས་ར་གལ་བ་དང་། གེ་སར་དང་། དཔལ་གྱི་སྙིང་པོ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་འབྱུང་ཞིང་སྐྱེ་བ་དང་། རིགས་དང་འབྱུང་ཁུངས་དང་། རིན་ཐང་གི་རྒྱུས་ཤེས་པར་བྱ་བ་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཁང་པ་དང་། རྒྱལ་པོའི་གནས་མངོན་པར་བསྒྲུབ་པ་དང་། རི་དགས་དང་། འཁོར་ལོ་དང་། མཚན་མ་བལྟ་བ་དང་། སེམས་ཅན་གྱི་མཚན་གྱི་ལྟས་དང་། ས་གཡོ་བ་དང་། ཕྱོགས་ཚིག་པ་དང་། སྐར་མདའ་ལྷུང་བ་དང་། དགེ་མྱི་དགེ་དང་། མུ་གེ་དང་ལོ་ལེགས་པ་ལ་སྩོགས་པ་འཇིག་རྟེན་གྱི་ཐ་མ་ལག་ཐམས་ཅད་ཀྱི་རྒྱུས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམ་པར་ཕྱེ་བ་ཐམས་ཅད་བརྗོད་ཅིང་བསྟན་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཡང་དག་པ་ཉིད་རྗེས་སུ་རིག་པར་བྱ་བའི་རྒྱུས་ལ་སྒྲིབ་པ་འམ། ཐེ་ཙོམ་མམ།
en: who have attained skill in the ways of all mantras and medicines; who heal demonic afflictions from bhūtas, planets and stars, apasmāras, kākhordas, and vetālas; who know the medicines and methods that heal the elements of beings; who know the practices of the collected methods for the elements; who know the origin, creation, classes, sources, and values of gold, jewels, pearls, beryl, conch, crystal, coral, red pearls, white coral, saffron, rubies, emeralds, and all precious materials;

source: ཡིད་གཉིས་སམ། ནེམ་ནུར་རམ། ཚམ་ཚོམ་མམ། མགོ་རྨོངས་པའམ། འཁོར་བའམ། མྱི་བདེ་བའམ། སྒྱིད་ལུག་པའམ།
en: who establish parks, forests for mendicants, towns, villages, regions, lands, and royal residences;

source: མྱི་ཤེས་པའམ།
en: who comprehend the zodiac, omens, signs on beings, earth tremors, red skies, shooting stars, good and bad signs , signs of famine and harvest, and all other mundane knowledge;

source: ཁོང་དུ་མི་ཆུད་པ་མྱེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པ་འམ།
en: and who can explain and teach and comprehend all the categories of supramundane qualities, knowing them correctly without obscuration, doubt, uncertainty, perplexity, indecision, bewilderment, stupidity, unhappiness, lack of confidence, lack of knowledge, or misunderstanding?

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ཡུལ་མ་ག་ངྷ་འདི་ཉིད་ཀྱི་ལྗོངས་དག་པ་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་འཚོ་བ་ཞེས་བྱ་བ་ན་དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་ཅེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: In the town called Vartanaka in the region called Kevalaka in this land of Magadha resides a kalyāṇamitra by the name of Bhadrottamā. Go to her and ask her, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ” Sudhana, the head merchant’s son, bowed his head to the feet of Śilpābhijña, the head merchant’s son.

source: ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ།
en: He circumambulated Śilpābhijña, the head merchant’s son, many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from Śilpābhijña, the head merchant’s son. Bhadrottamā

source: ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལྗོངས་དག་པའི་གྲོང་ཁྱེར་འཚོ་བ་གང་ན་བ་དང་། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: Sudhana, the head merchant’s son, went to the town called Vartanaka in the region of Kevalaka and approached the kalyāṇamitra Bhadrottamā.

source: དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: When he approached the kalyāṇamitra Bhadrottamā, he bowed his head to her feet, and then he stood before the kalyāṇamitra Bhadrottamā with his palms together in homage and said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་མས་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་གནས་མེད་པའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཤེས་ཤིང་སྟོན་པ་སྟེ། ཁོ་མོས་ཐོགས་པ་མྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་ཐོབ་པོ། །ཏིང་ངེ་འཛིན་དེ་ནི་ཆོས་གང་ལ་ཡང་ཐོགས་པ་མྱེད་དེ། དེ་ལ་གནས་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མྱིག་ཐོགས་པ་མེད་པ་ལ་འཇུག་གོ །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རྣ་བ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྣ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ལྕེ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ལུས་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡིད་ཐོགས་པ་མྱེད་པ་ཡང་རབ་ཏུ་འཇུག་གོ །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རླབས་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྣང་བ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཤུགས་ཐོགས་པ་མྱེད་པ་འགྲོ་བ་རབ་ཏུ་སྣང་བའི་དཀྱིལ་འཁོར་དག་ཀྱང་རབ་ཏུ་འཇུག་གོ །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་གནས་མེད་པའི་དཀྱིལ་འཁོར་འདི་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་ཟད་ན།
en: When he had said that, the kalyāṇamitra Bhadrottamā said, “Noble one, I know and teach the Dharma teaching called The Field without Location , and I have attained the samādhi called unimpeded . That samādhi is unimpeded toward any phenomenon, and when I rest within it, I have the unimpeded eyes of omniscience, I have the unimpeded ears of omniscience, I have the unimpeded nose of omniscience, I have the unimpeded tongue of omniscience, I have the unimpeded body of omniscience, I have the unimpeded mind of omniscience, I have the unimpeded waves of omniscience, I have the unimpeded lightning of omniscience, and I have the unimpeded power of omniscience and the field of the illumination of beings. “Noble one, I know only this Dharma teaching called The Field without Location

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཆགས་པ་མེད་པ་ལ་རིལ་གྱིས་ཤེས་པར་ནུས་རེ་སྐན།
en: How could I know completely unimpeded bodhisattva conduct? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་ན་གྲོང་ཁྱེར་རྒྱས་པའི་འགྲམ་ཞེས་པ་ཡོད་དེ།
en: In the southern region there is town called Bharukaccha.

source: དེ་ན་གསེར་འཚོང་གཅེས་པ་གཏོང་བ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: There resides a goldsmith by the name of Muktāsāra.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ” Sudhana, the head merchant’s son, bowed his head to the feet of the kalyāṇamitra Bhadrottamā.

source: དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the kalyāṇamitra Bhadrottamā many hundreds of thousands of times, keeping her to his right, and, looking back at her again and again, he departed from the kalyāṇamitra Bhadrottamā. Muktāsāra

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་དུ་སོང་སྟེ། གྲོང་ཁྱེར་རྒྱས་པའི་འགྲམ་དུ་གསེར་འཚོང་གཅེས་པ་གཏོང་བ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, eventually arrived in the southern region, and in the town of Bharukaccha he approached the goldsmith Muktāsāra.

source: གསེར་འཚོང་གཅེས་པ་གཏོང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to the feet of the goldsmith Muktāsāra and then, standing before him with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། དེས་སྨྲས་པ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མྱེད་པ་ལ་རྣམ་པར་དག་པས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཤེས་ཏེ།
en: When he had said that, the goldsmith Muktāsāra said, “Noble one, I know the bodhisattva liberation called the display of pureunimpeded memory.

source: ཁོ་བོས་ནི་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་ཆོས་ཡོངས་སུ་ཚོལ་བ་རྒྱུན་མི་གཅོད་པའོ།
en: I continuously seek the Dharma at the feet of the tathāgatas in the ten directions.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མེད་པ་ལ་རྣམ་པར་དག་པས་རྣམ་པར་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the display of pureunimpeded memory.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་བག་ཚ་བ་མྱེད་པར་སེང་གེའི་ང་རོ་སྒྲོག་པ་བསོད་ནམས་དང་ཡེ་ཤེས་ཆེན་པོ་ལ་གནས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of the bodhisattvas who have the fearless lion’s roar and are established in great merit and wisdom? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་རྒྱས་པའི་འགྲམ་གྱི་གྲོང་ཁྱེར་འདི་ཉིད་ན་ཁྱིམ་བདག་ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བ་རྟག་ཏུ་ཁྱིམ་སྣང་བར་གྱུར་པ་དང་ལྡན་པ་ཞིག་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ།
en: In the forest beside this town of Bharukaccha resides a householder by the name of Sucandra who has a continuously shining house.

source: སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་གསེར་འཚོང་གཅེས་པ་གཏོང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ” Sudhana, the head merchant’s son, bowed his head to the feet of the goldsmith Muktāsāra.

source: གསེར་འཚོང་གཅེས་པ་གཏོང་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། གསེར་འཚོང་གཅེས་པ་གཏོང་བའི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the goldsmith Muktāsāra many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the goldsmith Muktāsāra.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཁྱིམ་བདག་ཟླ་བ་བཟང་པོ་གང་ན་བ་དེར་སོང་སྟེ།
en: Sucandra

source: ཁྱིམ་བདག་ཟླ་བ་བཟང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Sudhana went to the householder Sucandra , bowed his head to the feet of the householder Sucandra , stood before him, and, with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་ཐོབ་སྟེ།
en: When he had said that, the householder Sucandra said, “Noble one, I know the bodhisattva liberation called the stainless light of wisdom

source: རིགས་ཀྱི་བུ་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་དྲི་མ་མྱེད་པའི་འོད་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the stainless light of wisdom

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཚད་མེད་པ་ཐོབ་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of the bodhisattvas who have attained countless liberations? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་རི་དགས་གནས་ཤེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a town called Roruka.

source: དེ་ན་ཁྱིམ་བདག་མྱི་ཕམ་སྡེ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁྱིམ་བདག་ཟླ་བ་བཟང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: There resides a householder by the name of Ajitasena. Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ” Sudhana, the head merchant’s son, bowed his head to the feet of the householder Sucandra

source: ཁྱིམ་བདག་ཟླ་བ་བཟང་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཁྱིམ་བདག་ཟླ་བ་བཟང་པོའི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the householder Sucandra many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the householder Sucandra

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་གྲོང་ཁྱེར་རི་དགས་ཀྱི་གནས་གང་ན་བ་དེར་སོང་སྟེ།
en: Ajitasena

source: ཁྱིམ་བདག་མི་ཕམ་སྡེ་གང་ན་བ་དེར་ཕྱིན་ནས། ཁྱིམ་བདག་མི་ཕམ་སྡེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Sudhana eventually reached the town of Roruka and approached the householder Ajitasena, bowed his head to the feet of the householder Ajitasena, stood before him, and, with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་མྱི་ཟད་པའི་མཚན་ཉིད་ཅེས་བྱ་བ་ཐོབ་སྟེ་དེ་ཐོབ་པས་ནི། སངས་རྒྱས་མི་ཟད་པ་མཐོང་བའི་གཏེར་རབ་ཏུ་ཐོབ་པར་འགྱུར་ཏོ།
en: When he had said that, the householder Ajitasena said, “Noble one, I have attained the bodhisattva liberation called unceasing characteristics so that I have attained the treasure of the unceasing vision of the buddhas. “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཆོས་ཀྱི་ཡུལ་གྲུ་ན་བྲམ་ཟེ་ཞི་འཛིན་མཆོག་ཅེས་བྱ་བ་ཞིག་འདུག་གིས།
en: In this southern region, in the village called Dharma , resides a brahmin by the name of Śivarāgra.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁྱིམ་བདག་མྱི་ཕམ་སྡེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ” Sudhana, the head merchant’s son, bowed his head to the feet of the householder Ajitasena.

source: ཁྱིམ་བདག་མི་ཕམ་སྡེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། ཁྱིམ་བདག་མི་ཕམ་སྡེའི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the householder Ajitasena many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the householder Ajitasena. Śivarāgra

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ཆོས་ཀྱི་ཡུལ་གྲུར་སོང་ནས།
en: Sudhana eventually reached the village of Dharma and approached the brahmin Śivarāgra.

source: བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གང་ན་བ་དེར་ཕྱིན་ཏེ། བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to the feet of the brahmin Śivarāgra, stood before him, and, with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། །དེས་སྨྲས་པ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་སྤྱོད་པ་སྟེ།
en: When he had said that, the brahmin Śivarāgra said, “Noble one, I have the conduct empowered by truth.

source: བདེན་པའི་ཚིག་གང་གིས་དུས་གསུམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ལྡོག་པར་མི་འགྱུར་ཞེ་ན།
en: There is the speech of truth by which the bodhisattvas in the three times have not turned back, do not turn back, and will never turn back from the highest, complete enlightenment.

source: བདེན་པའི་ཚིག་གི་བྱིན་གྱི་རླབས་དེས། བདག་གི་དགོས་པ་འདི་དང་འདི་ཞིག་གྲུབ་པར་ཤོག་ཤིག་ཅེས་བྱས་ན་ཡང་དེས་ཁོ་བོའི་བསམ་པ་ཐམས་ཅད་དེ་བཞིན་དུ་འགྲུབ་བོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བདེན་པའི་བྱིན་གྱི་རླབས་དེ་ལྟ་བུས་དགོས་པ་ཐམས་ཅད་སྒྲུབ་སྟེ།
en: Through the empowerment of that speech of truth, if I say ‘May this and that necessity be accomplished!’ then all my wishes become fulfilled.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་བདེན་པའི་བྱིན་གྱིས་རླབས་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this empowerment of the truth.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་བདེན་པའི་རྗེས་སུ་འབྲང་བའི་ཚིག་རབ་ཏུ་ཐོབ་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of the bodhisattvas who have attained the speech devoted to truth? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་ཡིད་བཟང་པོའི་སྒོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a town called Sumanāmukha.

source: དེ་ན་ཁྱེའུ་དཔལ་འབྱུང་བ་ཞེས་བྱ་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མ་ཞེས་བྱ་བ་གཉིས་ཤིག་འཁོད་ཀྱིས་དེའི་གན་དུ་སོང་ལ།
en: There resides a boy by the name of Śrīsaṃbhava and a girl by the name of Śrīmati.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་ཆོས་ཀྱི་རིམ་གྲོ་ཆེར་བསྐྱེད་དེ།
en: Go to them and ask them, ‘How should a bodhisattva train in and practice bodhisattva conduct?’

source: བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the brahmin Śivarāgra.

source: བྲམ་ཟེ་ཞི་འཛིན་མཆོག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས། བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the brahmin Śivarāgra many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the brahmin Śivarāgra. Śrīsaṃbhava and Śrīmati

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་གྲོང་ཁྱེར་ཡིད་བཟང་པོའི་སྒོར་སོང་སྟེ། ཁྱེའུ་དཔལ་འབྱུང་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མ་གང་ན་བ་དེར་ཕྱིན་ནས་དེ་གཉིས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana eventually reached the town of Sumanāmukha and approached the boy Śrīsaṃbhava and the girl Śrīmati.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to their feet, stood before them with his palms together in homage, and said, “Āryas, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Āryas, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པ་དག་གིས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་ནས་ཁྱེའུ་དཔལ་འབྱུང་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བདག་ཅག་གཉིས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྱུ་མའི་རྣམ་པ་ཞེས་བྱ་བ་ཐོབ་སྟེ།
en: The boy Śrīsaṃbhava and the girl Śrīmati said to Sudhana, the head merchant’s son, “Noble one, we have both attained and manifested the bodhisattva liberation called the appearance of illusion

source: མངོན་དུ་བྱས་སོ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ཅག་རྣམ་པར་ཐར་པ་འདི་དང་ལྡན་པས། འཇིག་རྟེན་ཐམས་ཅད་སྒྱུ་མའི་རྣམ་པར་རྒྱུ་རྐྱེན་སྒྱུ་མ་ལས་བྱུང་བར་མཐོང་ངོ་།
en: “Noble one, through possessing this liberation, we see all worlds as the appearance of illusions arising from illusory causes and conditions.

source: །ལས་དང་ཉོན་མོངས་པ་སྒྱུ་མར་ཤེས་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་ཤེས་སོ།
en: “We know karma and kleśas to be illusions, and so we know all beings to be the appearance of illusions.

source: །མ་རིག་པ་དང་། སྲིད་པ་དང་། སྲེད་པའི་རྒྱུ་ལས་བྱུང་བས་འགྲོ་བ་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་།
en: “We see that all beings are the appearance of illusions because they arise from illusory ignorance, becoming, and craving.

source: །ཕན་ཚུན་གྱི་རྐྱེན་གྱི་རྒྱུ་ལས་བྱུང་བས་ཆོས་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་།
en: “We see that all phenomena are the appearance of illusions because they arise from illusory interdependent conditions.

source: །ཕྱིན་ཅི་ལོག་གི་སྒྱུ་མ་ལས་བྱུང་བས་ཁམས་གསུམ་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་།
en: “We see that all three realms also are the appearance of illusions because they arise from erroneous illusions.

source: །ཡང་དག་པ་མ་ཡིན་པའི་རྟོག་པའི་རྒྱུས་བསྐྱེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤི་འཕོ་དང་། འབྱུང་བ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །འདུ་ཤེས་དང་སེམས་དང་ལྟ་བ་ཕྱིན་ཅི་ལོག་གི་རྒྱུ་ལས་དངོས་པོ་མྱེད་པའི་འདུ་ཤེས་ཀྱིས་རྨོངས་ཏེ།
en: “We see the passing away and transference, conception, birth, old age and death, misery, wailing, suffering, unhappiness, and agitation of all beings as the appearance of illusions because they arise from the illusion of incorrect thoughts. “We see all realms also as illusions because they arise from being bewildered by conceptions of nonexistence because of the illusions of erroneous conceptions, motivations, and views.
